In [3]:
3+4

7

In [4]:
"santosh"*2

'santoshsantosh'

# Comparison Operators

In [5]:
3==3

True

# Logical Operators

In [6]:
#and -> Returns the first false value; if not found returns the last
#OR  -> Retruns the first true value; if not found returns last

In [7]:
0 and 3

0

In [8]:
3 and 0

0

In [9]:
3 and 5

5

In [10]:
3 or 0

3

In [11]:
0 or 3

3

In [12]:
x=2
if(x%2==0):
    print("Even")
else:
    print("Not an even")

Even

In [13]:
y=98

if(y>98):
    print("Grade A")
elif(y>40):
    print("Grade B")
else:
    print("Print c")

Grade B

# Looping

In [14]:
#range(a,b) --> a =11, b=50

# loop starts at 11 and ends at (b-1) 49
for i in range(11,50):
    print(i)

11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49

In [15]:
# loop starts at 10 and ends at (b-1) 48; coz b-1 is 49, but we are looping till 49; 49+2= 51; which is wrong; so 48
for i in range(10,50,2):
    print(i)

10
12
14
16
18
20
22
24
26
28
30
32
34
36
38
40
42
44
46
48

In [16]:
for i in range(1,100,2):
    print(i)

1
3
5
7
9
11
13
15
17
19
21
23
25
27
29
31
33
35
37
39
41
43
45
47
49
51
53
55
57
59
61
63
65
67
69
71
73
75
77
79
81
83
85
87
89
91
93
95
97
99

In [17]:
for i in range(1,101,2):
    print(i)

1
3
5
7
9
11
13
15
17
19
21
23
25
27
29
31
33
35
37
39
41
43
45
47
49
51
53
55
57
59
61
63
65
67
69
71
73
75
77
79
81
83
85
87
89
91
93
95
97
99

# Functions

In [18]:
def compare(a,b):
    if(a>b):
        greater=a
    else:
        greater=b
    return greater

In [19]:
compare(10,2)

10

In [20]:
def Sum(lb,ub):
    total=0
    while(lb<=ub):
        total+=lb
        lb+=1
    return total

In [21]:
Sum(1,10)

55

# Lists

In [22]:
mars = [1,2,32,1,332,32,362,43]

In [23]:
mars[0:4]

[1, 2, 32, 1]

In [24]:
# add an element
mars.append(72)

In [25]:
mars.append([99,69])

In [26]:
mars

[1, 2, 32, 1, 332, 32, 362, 43, 72, [99, 69]]

In [27]:
#delete an element using Value

mars.remove(1)

In [28]:
mars

[2, 32, 1, 332, 32, 362, 43, 72, [99, 69]]

In [29]:
del mars[2]

In [30]:
mars

[2, 32, 332, 32, 362, 43, 72, [99, 69]]

In [31]:
for mark in mars:
    print(mark)

2
32
332
32
362
43
72
[99, 69]

# Dictionary

In [32]:
marks = {'history':52,"science":63,"social":99}

In [33]:
marks['history']

52

In [34]:
#Adding one element to dictionary
marks['biology']=36

#Adding more then one element to dictionary
marks.update({'math':85,'DS':86})

In [35]:
marks

{'history': 52,
 'science': 63,
 'social': 99,
 'biology': 36,
 'math': 85,
 'DS': 86}

In [36]:
del marks['social']

In [37]:
marks

{'history': 52, 'science': 63, 'biology': 36, 'math': 85, 'DS': 86}

# Pandas: Read File

In [38]:
import pandas as pd

In [39]:
df = pd.read_csv("./iris/data.csv")

In [40]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [41]:
#seeing the dimensions of the dataframe
df.shape

(891, 12)

In [42]:
#top 5 rows
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [43]:
# last 5 rows
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [44]:
#get the speciefied no row by passing paramerter
df.tail(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [45]:
#get all the columns name
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [46]:
#selectinga a single column
df['PassengerId']

0        1
1        2
2        3
3        4
4        5
      ...
886    887
887    888
888    889
889    890
890    891
Name: PassengerId, Length: 891, dtype: int64

In [47]:
#selecting mulitpile columns: To get the multipile columns you need to use List, 

df[['PassengerId','Survived','Fare']]

     PassengerId  Survived     Fare
0              1         0   7.2500
1              2         1  71.2833
2              3         1   7.9250
3              4         1  53.1000
4              5         0   8.0500
..           ...       ...      ...
886          887         0  13.0000
887          888         1  30.0000
888          889         0  23.4500
889          890         1  30.0000
890          891         0   7.7500

[891 rows x 3 columns]

In [48]:
#selecting rows by their positions 
df.iloc[0:5]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [49]:
#selecting columns by their positions

df.iloc[0:5,0:2]

   PassengerId  Survived
0            1         0
1            2         1
2            3         1
3            4         1
4            5         0

In [50]:
df['Survived']==1

0      False
1       True
2       True
3       True
4      False
       ...
886    False
887     True
888    False
889     True
890    False
Name: Survived, Length: 891, dtype: bool

In [51]:
df[df['Survived']==1]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [52]:
df3 = df[df['Survived']==1]

In [53]:
df3[:3]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S

In [54]:
#Mode: If you wanted to know fav subject of the student
# We cant summarize continuous data using mode

import pandas as pd

In [55]:
df4 = pd.read_csv("./iris/mode.csv")

In [56]:
df4.head()

   Student  Overall Marks Gender    Subject
0    Anish             97   Male    English
1  Rishabh             83   Male    English
2     Ajay             78   Male    Physics
3  Abhinav             86   Male  Chemistry
4   Anurag             91   Male    English

In [57]:
mode_data = df4["Subject"].mode()

In [58]:
print(mode_data)

0    Chemistry
dtype: object

#Types of variables

Continuos Variable : Contineous Numeric Values (Marks), winning time in a race
Caegorical Variable: Gender (male, Female)
  .Nominal Variable : Those who don't have inherit order to them, Gender (Male, Female)
  .Ordinal Variable : Teacher Feedback (Good, Bad, Excellent)
      Good is better then bed and excellent is better then good so
       Excellent > Good > Bad
Discrete: Countable, nothing in between, digital (10:42)
Number of oragnes in a bag

In [59]:
#Mean: mean is not sifinificant to use when any values changes significantely 

#Quantify the performance of the class based on the marks recieved to the student

import pandas as pd
#general use case file
df5 = pd.read_csv("./iris/mode.csv")
 
#Overall Marks
mean_data = df5["Overall Marks"].mean()
print(mean_data)

68.21

In [60]:
#if the value is very big then the above mean is not usefu, plz see the below example
df6 = pd.read_csv("./iris/mode-Copy1.csv")
df6.tail()

     Student  Overall Marks  Gender    Subject
96     vivek             55    Male    Physics
97     Tisha              7  Female    English
98    Raghav             73    Male    English
99    Ishita             82  Female  Chemistry
100  Ishita1          10000  Female  Chemistry

In [61]:
#Overall Marks
mean_data = df6["Overall Marks"].mean()
print(mean_data)

166.54455445544554

In [90]:
#Median: Absoulte central value of the data set
#If there is a lot of outliers in the dataset, go with median

#Step1: Arrange the data in to Ascending order
#Step2: Count the nubmer of elements in the dataset
#if the number of elements in the dataset is odd, the middle most element is the median,
#i.e  if we have n elements, the median would be n+1/2th element in the sotred series

#if the numbers of elements in the data is even, then the median would be the average of two central elements.
#So the median would be the average of n/2 th and n/2 +1 the elements

# Create the dataframe 
df = pd.DataFrame({'Cost':[2, 2, 4,8,9, 5,8]}) 
 
print(df.median(axis = 0))
# Step0: Sort the element first (V.IMP)
2,2,4,5,8,8,9
# Step1: the no of elements in the dataset is even
# 2,2,4,5,8,8,9 : odd (7)
# Step2:
# n+1/2 433

Cost    5.0
dtype: float64

(2, 2, 4, 5, 8, 8, 9)

In [97]:
# Create the dataframe 
medianEven = pd.DataFrame({'Cost':[2,2,4,5,8,8]}) 
 
print(medianEven.median(axis = 0))
# Step0: Sort the element first (V.IMP)
2,2,4,5,8,8
# Step1: the no of elements in the dataset is even
# 2,2,4,5,8,8 : even (6)
# Step2:
# n/2, n+1/2
# 4+5/2

Cost    4.5
dtype: float64

(2, 2, 4, 5, 8, 8)

In [99]:
# 0 quartile = 0 quantile = 0 percentile

# 1 quartile = 0.25 quantile = 25 percentile

# 2 quartile = .5 quantile = 50 percentile (median)

# 3 quartile = .75 quantile = 75 percentile

# 4 quartile = 1 quantile = 100 percentile

In [101]:
dfMedian = pd.read_csv("./iris/mode-Copy1.csv")
dfMedian.tail()

     Student  Overall Marks  Gender    Subject
96     vivek             55    Male    Physics
97     Tisha              7  Female    English
98    Raghav             73    Male    English
99    Ishita             82  Female  Chemistry
100  Ishita1          10000  Female  Chemistry

In [103]:
#calculating the median
dfMedian['Overall Marks'].median()

77.0

In [108]:
#quartile: divide the value of dataset into Quarters
#Quantile: Any arbitary data, it can take any values between 0 and 1 (0.5,0.42)

Q1 = dfMedian['Overall Marks'].quantile(0.25)
Q2 = dfMedian['Overall Marks'].quantile(0.5)
Q3 = dfMedian['Overall Marks'].quantile(0.75)
Q4 = dfMedian['Overall Marks'].quantile(1)


Q5 = dfMedian['Overall Marks'].quantile(0.42)


print("First Quartile",Q1)
print("Second Quartile",Q2)
print("Third Quartile",Q3)
print("Fourth Quartile",Q4)

print("Arbitary  Quartile",Q5)

First Quartile 58.0
Second Quartile 77.0
Third Quartile 88.0
Fourth Quartile 10000.0
Arbitary  Quartile 73.0

In [110]:
# What is the possible value for the median of the below wages?

# Wage (in Rs)	No. of persons
# 20-30         2 
# 30-40	        8
# 40-50	        20
# 50-60	        12
# 60-70	        8

# Answer 47.5


#Median = L +  [(n/2) − B] / G × w
# L is the lower class boundary of the group containing the median 
# n is the total number of values 
# B is the cumulative frequency of the groups before the median group 
# G is the frequency of the median group 
# w is the group width 
# If you look at the problem, median class is 40 - 50. So, 

# L = 40

# n = Total number of persons = 50

# B = Cumulative frequency till the class 30 - 40 which is = 10

# G = 20

# W = 10

# If you impute these values in the above formula, you will get 47.5 as the answer.

SyntaxError: invalid syntax (<ipython-input-110-8e8f8a294d09>, line 10)